In [5]:
import pandas as pd
import numpy as np

In [3]:
l=['Apple',2]
s=pd.Series(l)
print(s)
print(type(s))

0    Apple
1        2
dtype: object
<class 'pandas.core.series.Series'>

In [4]:
l=['Apple',2]
s=pd.Series(l,index=['a','c'])
print(s)
print(type(s))

a    Apple
c        2
dtype: object
<class 'pandas.core.series.Series'>

In [6]:
a=np.array(['banana',42])
print(a,type(a))
s=pd.Series(a,index=['a','b'])
print(s)

['banana' '42'] <class 'numpy.ndarray'>
a    banana
b        42
dtype: object

In [8]:
d={'a':[1,2,3],'b':[3,2,1]}
s=pd.Series(d)
print(s)

a    [1, 2, 3]
b    [3, 2, 1]
dtype: object

In [12]:
s={'coll':[1,2,5,8,9]}
df=pd.DataFrame(s)
df

   coll
0     1
1     2
2     5
3     8
4     9

In [13]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [16]:
df.shape

(5, 1)

In [17]:
import pandas as pd
df = pd.read_csv('DemographicData.csv')
print(df)

             Country Name Country Code  Birth rate  Internet users  \
0                   Aruba          ABW      10.244            78.9
1             Afghanistan          AFG      35.253             5.9
2                  Angola          AGO      45.985            19.1
3                 Albania          ALB      12.877            57.2
4    United Arab Emirates          ARE      11.044            88.0
..                    ...          ...         ...             ...
190           Yemen, Rep.          YEM      32.947            20.0
191          South Africa          ZAF      20.850            46.5
192      Congo, Dem. Rep.          COD      42.394             2.2
193                Zambia          ZMB      40.471            15.4
194              Zimbabwe          ZWE      35.715            18.5

            Income Group
0            High income
1             Low income
2    Upper middle income
3    Upper middle income
4            High income
..                   ...
190  Lower middle income
191  Upper middle income
192           Low income
193  Lower middle income
194           Low income

[195 rows x 5 columns]

In [1]:
import pandas as pd
df = pd.read_csv('DemographicData.csv')
print(df)

             Country Name Country Code  Birth rate  Internet users  \
0                   Aruba          ABW      10.244            78.9
1             Afghanistan          AFG      35.253             5.9
2                  Angola          AGO      45.985            19.1
3                 Albania          ALB      12.877            57.2
4    United Arab Emirates          ARE      11.044            88.0
..                    ...          ...         ...             ...
190           Yemen, Rep.          YEM      32.947            20.0
191          South Africa          ZAF      20.850            46.5
192      Congo, Dem. Rep.          COD      42.394             2.2
193                Zambia          ZMB      40.471            15.4
194              Zimbabwe          ZWE      35.715            18.5

            Income Group
0            High income
1             Low income
2    Upper middle income
3    Upper middle income
4            High income
..                   ...
190  Lower middle income
191  Upper middle income
192           Low income
193  Lower middle income
194           Low income

[195 rows x 5 columns]

In [2]:
df.head()

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [3]:
df.tail()

,Country Name,Country Code,Birth rate,Internet users,Income Group
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [4]:
df.shape

(195, 5)

In [7]:
df.size

975

In [8]:
df.columns

Index(['Country Name', 'Country Code', 'Birth rate', 'Internet users',
       'Income Group'],
      dtype='object')

In [9]:
df.keys()

Index(['Country Name', 'Country Code', 'Birth rate', 'Internet users',
       'Income Group'],
      dtype='object')

In [10]:
df.dtypes

Country Name       object
Country Code       object
Birth rate        float64
Internet users    float64
Income Group       object
dtype: object

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
Country Name      195 non-null object
Country Code      195 non-null object
Birth rate        195 non-null float64
Internet users    195 non-null float64
Income Group      195 non-null object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

In [22]:
df['Country Name'].value_counts()

Bhutan               1
Costa Rica           1
China                1
Brunei Darussalam    1
Azerbaijan           1
                    ..
Sudan                1
Finland              1
Timor-Leste          1
Lao PDR              1
Suriname             1
Name: Country Name, Length: 195, dtype: int64

In [14]:
df.reset_index()

,index,Country Name,Country Code,Birth rate,Internet users,Income Group
0,0,Aruba,ABW,10.244,78.9,High income
1,1,Afghanistan,AFG,35.253,5.9,Low income
2,2,Angola,AGO,45.985,19.1,Upper middle income
3,3,Albania,ALB,12.877,57.2,Upper middle income
4,4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...,...
190,190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,191,South Africa,ZAF,20.850,46.5,Upper middle income
192,192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,193,Zambia,ZMB,40.471,15.4,Lower middle income
194,194,Zimbabwe,ZWE,35.715,18.5,Low income

In [23]:
df.set_index('Birth rate')

,Country Name,Country Code,Internet users,Income Group
Birth rate,,,,
10.244,Aruba,ABW,78.9,High income
35.253,Afghanistan,AFG,5.9,Low income
45.985,Angola,AGO,19.1,Upper middle income
12.877,Albania,ALB,57.2,Upper middle income
11.044,United Arab Emirates,ARE,88.0,High income
...,...,...,...,...
32.947,"Yemen, Rep.",YEM,20.0,Lower middle income
20.850,South Africa,ZAF,46.5,Upper middle income
42.394,"Congo, Dem. Rep.",COD,2.2,Low income
40.471,Zambia,ZMB,15.4,Lower middle income
35.715,Zimbabwe,ZWE,18.5,Low income

In [24]:
df['Birth rate'].mean()

21.469928205128202

In [25]:
df['Birth rate'].median()

19.68

In [26]:
df['Birth rate'].min()

7.9

In [27]:
df['Birth rate'].max()

49.661

In [28]:
df['Birth rate'].sum()

4186.6359999999995

In [29]:
df['Birth rate'].product()

2.153394681538576e+249

In [30]:
df['Birth rate'].nlargest()

127    49.661
2      45.985
167    45.745
11     44.151
115    44.138
Name: Birth rate, dtype: float64

In [31]:
df['Birth rate'].nsmallest()

74     7.9
142    7.9
89     8.2
45     8.5
68     8.5
Name: Birth rate, dtype: float64

In [33]:
import pandas as pd
df = pd.DataFrame({'A':[1,2,3,4,5],'B':['a','b','c','d','e'],'C':[10,20,30,40,50]})
subset=df.iloc[1:3,0:2]
print(subset)

   A  B
1  2  b
2  3  c